app/controllers/application_controller.rb

  def get_current_user
    return if !bearer_token
    decode_jwt = decode_token(bearer_token)
    User.find(decode_jwt[0]["user"]["id"])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]