app/controllers/bookings_controller.rb

  def create
    @booking = Booking.new(booking_params)

    if @booking.save
---
INSERT INTO "bookings" ("user_id", "session_id", "booked_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 3], ["session_id", 7], ["booked_date", "2019-08-12 18:54:27.551000"], ["created_at", "2019-08-13 02:28:13.587830"], ["updated_at", "2019-08-13 02:28:13.587830"]]